#### Import the pandas

In [3]:
import pandas as pd

#### Series

In [5]:
s = pd.Series([54,22,15,36,58,71])

In [6]:
s

0    54
1    22
2    15
3    36
4    58
5    71
dtype: int64

In [7]:
s.ndim

1

In [8]:
s.size

6

In [9]:
s.shape

(6,)

In [10]:
s[2]

15

In [11]:
s[2] = 45
print(s)

0    54
1    22
2    45
3    36
4    58
5    71
dtype: int64

In [13]:
s = pd.Series([54,22,15,36,58,71], index=range(100,106))

In [14]:
s

100    54
101    22
102    15
103    36
104    58
105    71
dtype: int64

In [15]:
s.dtype

dtype('int64')

In [16]:
import numpy as np

In [17]:
s = pd.Series([54,22,15,36,58,71], 
              index=range(100,106), dtype=np.int16)

In [18]:
s

100    54
101    22
102    15
103    36
104    58
105    71
dtype: int16

#### DataFrame

In [20]:
r = pd.Series(range(1,6))
n = pd.Series(['Raju','Riya','Rakesh','Ratan','Rani'])
m = pd.Series([67.88, 54.34, 81.34, 74.55, 66.66])

In [21]:
df = pd.DataFrame({
    'roll': r,
    'name': n,
    'marks': m
})

In [22]:
df

   roll    name  marks
0     1    Raju  67.88
1     2    Riya  54.34
2     3  Rakesh  81.34
3     4   Ratan  74.55
4     5    Rani  66.66

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
type(s)

pandas.core.series.Series

In [25]:
df.shape

(5, 3)

In [26]:
df.ndim

2

In [27]:
df.size

15

In [28]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

#### Data Operations

In [30]:
# https://mitu.co.in/dataset
# Download all datasets whose name starts with student....
# Store them in current working directory

In [31]:
import os
os.getcwd()

'/home/mitu'

#### Import the file

In [33]:
df = pd.read_csv('student.csv')

In [34]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [35]:
type(df)

pandas.core.frame.DataFrame

In [36]:
df1 = pd.read_csv('student1.csv')

In [37]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [38]:
cols = ['A','B','C','D','E']
df1 = pd.read_csv('student1.csv', names=cols)

In [39]:
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [44]:
df3 = pd.read_csv('student3.tsv', sep='\t')

In [45]:
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [43]:
print('hello\tworld')

hello	world

#### Data Description

In [47]:
df.shape

(10, 5)

In [48]:
df.ndim

2

In [49]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [50]:
list(df.columns)

['roll', 'name', 'class', 'marks', 'age']

#### Data Slicing

In [53]:
x = df.iloc[2:8,1:4]

In [54]:
x

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [55]:
df.iloc[:8,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [56]:
df.iloc[2:,1:4]

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [57]:
df.iloc[2:8,:4]

   roll     name class  marks
2     3   aniket    BE  76.88
3     4  ajinkya    TE  69.66
4     5     asha    TE  63.28
5     6   ayesha    BE  49.55
6     7     amar    BE  65.34
7     8    amita    BE  68.33

In [58]:
df.iloc[2:8,1:]

      name class  marks  age
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23

In [59]:
df.iloc[2:,1:]

      name class  marks  age
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20
9    anmol    BE  78.66   21

In [60]:
df.iloc[5:,1:3]

     name class
5  ayesha    BE
6    amar    BE
7   amita    BE
8    amol    TE
9   anmol    BE

In [61]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [62]:
df.iloc[[2,5,6,8],:]

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
8     9    amol    TE  56.75   20

In [63]:
df.iloc[[2,5,6,8],[1,2,4]]

     name class  age
2  aniket    BE   19
5  ayesha    BE   20
6    amar    BE   19
8    amol    TE   20

In [64]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [65]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [66]:
df['name'][4]

'asha'

In [67]:
df.iloc[4,1]

'asha'

In [68]:
df.iloc[4,:]

roll         5
name      asha
class       TE
marks    63.28
age         20
Name: 4, dtype: object

In [70]:
df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [73]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [74]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [75]:
df.name[4]

'asha'

In [76]:
df.drop(4)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [77]:
df.drop([4,8,9])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23

In [78]:
df.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [79]:
df.drop(['class','age'], axis = 1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

#### Functions or methods

In [81]:
df['marks'].mean()

64.499

In [82]:
df['marks'].max()

78.66

In [83]:
df['marks'].min()

49.55

In [84]:
df['marks'].sum()

644.9899999999999

In [85]:
df['marks'].median()

64.31

In [86]:
df['marks'].count()

10

In [87]:
df['marks'].std()

9.207178901994535

In [89]:
df.mean(numeric_only=True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [90]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [91]:
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [92]:
df.median(numeric_only=True)

roll      5.50
marks    64.31
age      20.00
dtype: float64

In [94]:
df.mean(numeric_only=True, axis = 1)

0    26.590000
1    27.590000
2    32.960000
3    31.220000
4    29.426667
5    25.183333
6    30.446667
7    33.110000
8    28.583333
9    36.553333
dtype: float64

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [96]:
df[['marks','age']].mean()

marks    64.499
age      20.500
dtype: float64

In [97]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [100]:
x = df['age']

In [102]:
x.median()

20.0

In [105]:
x[7] = 43

<ipython-input-105-d7193420c26b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[7] = 43

In [107]:
x.median()

20.0

In [108]:
x.mean()

22.5

#### Add custom columns

In [110]:
df['marks'] / 10 + 1.05

0    6.727
1    7.027
2    8.738
3    8.016
4    7.378
5    6.005
6    7.584
7    7.883
8    6.725
9    8.916
Name: marks, dtype: float64

In [112]:
df['marks'] = df['marks'] + 0.5

In [113]:
df

   roll     name class  marks  age
0     1     anil    TE  57.27   22
1     2     amit    TE  60.27   21
2     3   aniket    BE  77.38   19
3     4  ajinkya    TE  70.16   20
4     5     asha    TE  63.78   20
5     6   ayesha    BE  50.05   20
6     7     amar    BE  65.84   19
7     8    amita    BE  68.83   43
8     9     amol    TE  57.25   20
9    10    anmol    BE  79.16   21

In [114]:
df['cgpa'] = df['marks'] / 10 + 1.05

In [115]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  57.27   22  6.777
1     2     amit    TE  60.27   21  7.077
2     3   aniket    BE  77.38   19  8.788
3     4  ajinkya    TE  70.16   20  8.066
4     5     asha    TE  63.78   20  7.428
5     6   ayesha    BE  50.05   20  6.055
6     7     amar    BE  65.84   19  7.634
7     8    amita    BE  68.83   43  7.933
8     9     amol    TE  57.25   20  6.775
9    10    anmol    BE  79.16   21  8.966

In [116]:
x = ['M','M','M','M','F','F','M','F','M','M']

In [117]:
df['gender'] = x

In [118]:
df

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  57.27   22  6.777      M
1     2     amit    TE  60.27   21  7.077      M
2     3   aniket    BE  77.38   19  8.788      M
3     4  ajinkya    TE  70.16   20  8.066      M
4     5     asha    TE  63.78   20  7.428      F
5     6   ayesha    BE  50.05   20  6.055      F
6     7     amar    BE  65.84   19  7.634      M
7     8    amita    BE  68.83   43  7.933      F
8     9     amol    TE  57.25   20  6.775      M
9    10    anmol    BE  79.16   21  8.966      M

In [121]:
df.drop(['cgpa','gender'], axis = 1,inplace=True)

In [122]:
df

   roll     name class  marks  age
0     1     anil    TE  57.27   22
1     2     amit    TE  60.27   21
2     3   aniket    BE  77.38   19
3     4  ajinkya    TE  70.16   20
4     5     asha    TE  63.78   20
5     6   ayesha    BE  50.05   20
6     7     amar    BE  65.84   19
7     8    amita    BE  68.83   43
8     9     amol    TE  57.25   20
9    10    anmol    BE  79.16   21

In [123]:
df['class'].value_counts()

TE    5
BE    5
Name: class, dtype: int64

In [124]:
df['age'].value_counts()

20    4
21    2
19    2
22    1
43    1
Name: age, dtype: int64

In [125]:
df['age'].mode()

0    20
Name: age, dtype: int64

In [126]:
df['class'].mode()

0    BE
1    TE
Name: class, dtype: object

#### Join / Merge the tables

In [129]:
ndf = pd.DataFrame({
    'roll': range(1,11),
    'cgpa': df['marks'] / 10 + 1.03,
    'gender': ['M','M','M','M','F','F','M','F','M','M']
})

In [130]:
ndf

   roll   cgpa gender
0     1  6.757      M
1     2  7.057      M
2     3  8.768      M
3     4  8.046      M
4     5  7.408      F
5     6  6.035      F
6     7  7.614      M
7     8  7.913      F
8     9  6.755      M
9    10  8.946      M

In [131]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [132]:
ndf.columns

Index(['roll', 'cgpa', 'gender'], dtype='object')

In [135]:
adf = df.merge(ndf)

In [136]:
adf

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  57.27   22  6.757      M
1     2     amit    TE  60.27   21  7.057      M
2     3   aniket    BE  77.38   19  8.768      M
3     4  ajinkya    TE  70.16   20  8.046      M
4     5     asha    TE  63.78   20  7.408      F
5     6   ayesha    BE  50.05   20  6.035      F
6     7     amar    BE  65.84   19  7.614      M
7     8    amita    BE  68.83   43  7.913      F
8     9     amol    TE  57.25   20  6.755      M
9    10    anmol    BE  79.16   21  8.946      M

#### Append or concat the tables

In [140]:
bdf = pd.read_csv('student5.csv')

In [141]:
bdf

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [143]:
pd.concat([df,bdf], ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  57.27   22
1      2     amit    TE  60.27   21
2      3   aniket    BE  77.38   19
3      4  ajinkya    TE  70.16   20
4      5     asha    TE  63.78   20
5      6   ayesha    BE  50.05   20
6      7     amar    BE  65.84   19
7      8    amita    BE  68.83   43
8      9     amol    TE  57.25   20
9     10    anmol    BE  79.16   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

#### Grouping the data

In [145]:
gr = df.groupby('class')

In [146]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [147]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  57.27   22
1     2     amit    TE  60.27   21
3     4  ajinkya    TE  70.16   20
4     5     asha    TE  63.78   20
8     9     amol    TE  57.25   20

In [148]:
gr.get_group('BE')

   roll    name class  marks  age
2     3  aniket    BE  77.38   19
5     6  ayesha    BE  50.05   20
6     7    amar    BE  65.84   19
7     8   amita    BE  68.83   43
9    10   anmol    BE  79.16   21

In [149]:
gr.count()

       roll  name  marks  age
class
BE        5     5      5    5
TE        5     5      5    5

In [151]:
gr.mean(numeric_only=True)

       roll   marks   age
class
BE      6.8  68.252  24.4
TE      4.2  61.746  20.6

In [152]:
gr.agg([min,max])

      roll         name          marks        age
       min max      min     max    min    max min max
class
BE       3  10     amar  ayesha  50.05  79.16  19  43
TE       1   9  ajinkya    asha  57.25  70.16  20  22

#### Boolean filtering

In [154]:
df['marks'] > 60

0    False
1     True
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [155]:
df[df['marks'] > 60]

   roll     name class  marks  age
1     2     amit    TE  60.27   21
2     3   aniket    BE  77.38   19
3     4  ajinkya    TE  70.16   20
4     5     asha    TE  63.78   20
6     7     amar    BE  65.84   19
7     8    amita    BE  68.83   43
9    10    anmol    BE  79.16   21

In [156]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]

In [157]:
x

   roll    name class  marks  age
2     3  aniket    BE  77.38   19
6     7    amar    BE  65.84   19
7     8   amita    BE  68.83   43
9    10   anmol    BE  79.16   21

#### Export the data

In [159]:
x.to_csv('output.csv', index=True)

In [161]:
x = np.arange(1,101)

In [169]:
y = np.array([97,4,67,45,21])

In [170]:
x.mean()

50.5

In [171]:
y.mean()

46.8